Tekla Open API Reference for Tekla Structures 2025
AnalysisCompositeBeam.SlabWidthRight Property
 The right width of the slab of the analysis composite beam.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double SlabWidthRight { get; set; }
Public Property SlabWidthRight As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnalysisCompositeBeam Class
Tekla.Structures.Analysis Namespace